{
  "total": 1090,
  "limit": 1,
  "categories": "all",
  "media": "all",
  "skip": 0,
  "startIndex": 0,
  "placement": "",
  "tags": "BR-rainbow-six GA-siege",
  "items": [
    {
      "id": "SHGmibf5X44",
      "title": "Rainbow Six Siege: Tachanka Elite Set - New on the Six | Ubisoft",
      "abstract": null,
      "thumbnail": {
        "url": "https://i.ytimg.com/vi/SHGmibf5X44/maxresdefault.jpg",
        "description": "Rainbow Six Siege: Tachanka Elite Set - New on the Six | Ubisoft"
      },
      "content": "[video](https://www.youtube.com/embed/SHGmibf5X44)",
      "description": "All hail Lord Tachanka! Unlock his new Elite set and show off the Slava Korolyu uniform, headgear, victory dance, gadget for the Shumikha Launcher, weapon skin for the DP-28, 9x19VSN, GSH18, and PMM, and the Elite Tachanka Chibi charm.\n\n#R6S\n\nPlease SUBSCRIBE: http://bit.ly/UbisoftYouTubeChannel\n \nVisit our official channels to stay up to date with Rainbow Six Siege:\nhttps://rainbow6.ubisoft.com/\nhttps://www.facebook.com/rainbow6usa/\nhttps://www.instagram.com/rainbow6gam...\nhttps://twitter.com/Rainbow6Game\nhttps://www.youtube.com/UbisoftNA\n \nDiscover all our Rainbow Six products and exclusive items on the Ubisoft Store: https://ubi.li/DZNaP\n \nABOUT RAINBOW SIX SIEGE:\nRainbow Six Siege is an exciting, new approach to the first-person shooter experience that puts tactical combat and masterful destruction at the center of the action. Lead your team of unique, counter-terrorist Rainbow operators through tense and thrilling combat scenarios, and achieve victory through smart preparation and strategic improvisation. Rainbow Six Siege is available now on Xbox One, PlayStation® 4 and PC.\n  \n KEY FEATURES:\n  \n -THE RULES OF SIEGE: Five versus Five. Attack versus Defend. Infiltrate versus Fortify. Team-based strategy meets intense, tactical combat.\n -WORLD'S ELITE COUNTER-TERRORIST OPERATORS: Choose your Operator and wield their unique ability to breach or defend the objective as a part of an elite team.\n -DESTRUCTION AS A TOOL: Walls can be shattered; floors and ceilings can be breached. Mastering the tactical use of destruction is the key to victory.\n -CLOSE-QUARTERS COMBAT: With tight spaces shaping all combat arenas, tense encounters and up-close-and-personal firefights abound within every Siege.\n\nABOUT UBISOFT:\nUbisoft is a creator of worlds, committed to enriching players' lives with original and memorable gaming experiences. Our rich portfolio of world-renowned brands includes: Assassin’s Creed, Far Cry, For Honor, Just Dance, Watch Dogs, Tom Clancy’s video game series including Ghost Recon, Rainbow Six and The Division.  We are dedicated to delivering original and memorable gaming experiences across all popular platforms, including consoles, mobile phones, tablets and PCs. To learn more, please visit www.ubisoft.com.\n \n© 2020 Ubisoft Entertainment. All Rights Reserved. Ubisoft, and the Ubisoft logo are registered or unregistered trademarks of Ubisoft Entertainment in the US and/or other countries.\n\nRainbow Six Siege: Tachanka Elite Set - New on the Six | Ubisoft [NA]\nhttp://www.youtube.com/UbisoftNA",
      "categories": [
        "videos"
      ],
      "tag": null,
      "placement": null,
      "type": "videos",
      "readTime": null,
      "url": "https://www.youtube.com/watch?v=SHGmibf5X44",
      "date": "2020-11-17T22:00:47.000Z"
    }
  ]
}