{
  "total": 724,
  "limit": 1,
  "categories": "all",
  "media": "all",
  "skip": 0,
  "startIndex": 0,
  "placement": [],
  "tags": [
    "BR-rainbow-six GA-siege"
  ],
  "items": [
    {
      "id": "5uvJIketTRZux4L1T4I3Ij",
      "title": "Y7S1 Demon Veil Patch Notes Addendum",
      "abstract": "Updates and fixes made over the course of the Y7S1 Season Test Server.",
      "thumbnail": {
        "url": "https://staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6DStEARPoulRIUcYj99pjJ/51bd38d385aa73bdb682de74e5a1350f/R6S_Y7S1_PatchNotes_Thumbnail.jpg",
        "description": null
      },
      "content": "You can find here the updates and fixes made over the course of the Y7S1 Season Test Server. For the full Demon Veil Patch Notes, follow the link below.\n\nDemon Veil Season Patch Notes: [https://rainbow6.com/](https://rainbow6.com/highcalibre)[demonveil](https://www.ubisoft.com/en-us/game/rainbow-six/siege/game-info/seasons/demonveil).\n\n### Y7S1 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 4.4 GB\n- Steam: 3.8 GB\n- Xbox One: 13.82 GB\n- Xbox Series X: 13.17 GB\n- PS4: 5.17 GB\n- PS5: 4.66 GB\n\n### GAMEPLAY\n\nFIXED - Camera is zoomed out while aiming down sights with the Reflex B sight equipped.\n\nFIXED - Entering Observation Tools will default to security cameras if one of a player's Observation Tools was picked up or destroyed.\n\nFIXED - Unable to pick up some devices that are deployed into small spaces.\n\nFIXED - Camera goes out of bounds if watching a kill cam when the end of round replay begins.\n\nFIXED - Windows don't break when deploying a device on a barricade.\n\nFIXED - After spawning, crosshairs can sometimes remain visible while aiming down sights.\n\nFIXED - Camera goes out of bounds for Attackers in support mode when the last Attacker is eliminated and there are no Observation Tools on their team.\n\nFIXED - Bulletproof Camera EMP burst disables electronic map objects for 15 seconds instead of 6 seconds.\n\nFIXED - Bulletproof Camera EMP burst can destroy fragile map objects.\n\nFIXED - Crosshairs of the Reflex B sight are obstructed by the iron sights of various weapons.\n\nFIXED - Defuser disappears if an Attacker picks up the defuser and disconnects between Attacker lock and the start of the Action Phase.\n\nFIXED - SPAS-15 shotgun has no reticle for some non-magnifying sights.\n\nFIXED - Enemy AI doesn't interact with Azami's Kiba Barriers.\\\n\n### LEVEL DESIGN\n\nFIXED - Multiple LOD issues on various maps.\n\nFIXED - Azami's Kiba Barrier doesn't break when the breakable wall it's deployed on is completely destroyed.\n\n__BANK__\n\nFIXED - Valkyrie's Black Eye doesn't lose signal when thrown onto the garage door outside at EXT Garage Ramp on Bank map.\n\n__COASTLINE__\n\nFIXED - Ceiling decals in 1F Blue Bar aren't destroyed when destroying the floor in 2F Billiard floor on Coastline map.\n\nFIXED - Valkyrie's Black Eye loses signal on the ceilings of various second floor rooms on Coastline map.\n\n__FAVELA__\n\nFIXED - Players can defuse the same bomb site twice to win a Training Grounds match on Favela map.\n\n__KANAL__\n\nFIXED - Valkyrie's Black Eye doesn't lose signal when thrown outside onto the bottom of 2F Upper Bridge on Kanal map.\n\n__OUTBACK__\n\nFIXED - Azami's Kiba Barrier can allow players to get inside the shark on Outback map.\n\n__THEME PARK__\n\nFIXED - Valkyrie's Black Eye loses signal at 1F Yellow Corridor drone vent on Theme Park map.\n\n__TOWER__\n\nFIXED - Ace's S.E.L.M.A. Aqua Breacher activates when deployed on the indestructible floor in 1F Lounge on Tower map.\n\n### OPERATORS\n\nFIXED - Various Operators are missing some non-magnifying weapon sights.\n\nFIXED - Various modelling and clipping issues.\n\nFIXED - Various animation issues.\n\n__ACE__\n\nFIXED - Ace's S.E.L.M.A. Aqua Breacher has no SFX when equipped and held.\n\n__ARUNI__\n\nFIXED - Aruni's MK14 EBR is missing Muzzle Brake from weapon barrels.\n\n__AZAMI__\n\nFIXED - Azami's Kiba Barrier doesn't collapse when an operator stands on it.\n\nFIXED - Azami's Kiba Barrier deployment VFX are visible from the other side of walls.\n\nFIXED - Azami's Kiba Barrier deployment VFX aren't visible when watching a match replay.\n\nFIXED - Azami's Kiba Barrier destroys Goyo's Volcán Canisters when it expands.\n\nFIXED - Azami's Kiba Barrier doesn't destroy the canister of Mira's Black Mirror when it expands, making the canister indestructible.\n\nFIXED - Azami's Kiba Barrier doesn't break when an Operator stands on it if it was deployed on a hatch that gets destroyed afterward.\n\nFIXED - Azami's Kiba Barrier doesn't break when an Attacker exits rappel through the Barrier.\n\nFIXED - Azami's Kiba Barrier can sometimes prevent vaulting through windows when it's deployed on a ceiling.\n\n__BANDIT__\n\nFIXED - Bandit's Shock Wire can't be deployed on a reinforced hatch when another device is in the center of it.\n\n__CAPITÃO__\n\nFIXED - Incendiary bolts from Capitão's Tactical Crossbow don't disappear when Capitão disconnects.\n\n__CAVEIRA__\n\nFIXED - Caveira's SPAS-15 Reflex C sight is incorrectly attached to the weapon.\n\n__FLORES__\n\nFIXED - Flores' RCE-Ratero Charge floats midair when affected by Mute's Signal Disruptor while jumping.\n\nFIXED - Activating Flores' RCE-Ratero Charge changes the Observation Tool that an Operator was viewing.\n\n__FUZE__\n\nFIXED - Fuze's AK12 is missing Scope 2.0x from weapon sights.\n\nFIXED - Fuze's Cluster Charge can be deployed on an angle where a reinforced and indestructible wall meet.\n\n__GOYO__\n\nFIXED - Defenders lose the round and Goyo gets a Friendly Fire penalty if an Attacker moves the hostage near a Volcán Canister and disconnects after deploying a device to destroy the canister.\n\n__IQ__\n\nFIXED - IQ's Electronics Detector can detect Azami's Kiba Barrier when the kunai is the environment but undeployed.\n\n__MAESTRO__\n\nFIXED - Bullet impact visuals appear on both of Maestro's Evil Eyes when only one is shot.\n\n__MAVERICK__\n\nFIXED - Maverick's Breaching Torch is unable to breach a reinforced wall when an Operator's shield is pressed against the other side.\n\n__MELUSI__\n\nFIXED - Melusi's Banshee detects Operators through Azami's Kiba Barrier.\n\n__OSA__\n\nFIXED - Osa's Talon-8 Shield remains visible if it's destroyed by Maverick's Breaching Torch during deployment.\n\n__PULSE__\n\nFIXED - Pulse's Cardiac Sensor can't be unequipped after a player equips it and immediately swaps to a gadget.\n\n__TACHANKA__\n\nFIXED - Tachanka's DP27 has no reticle when aiming down some non-magnifying sights.\n\n__WAMAI__\n\nFIXED - Defenders lose the round and Wamai gets a Friendly Fire penalty if an Attacker moves the hostage near Wamai's MAG-Net and disconnects after deploying a device to destroy the MAG-Net.\n\n__YING__\n\nFIXED - Ying is unable to vault while holding a Candela.\n\n__ZERO__\n\nFIXED - Zero's SC3000K has access to Scope 2.5x A in weapon sights.\n\n### USER EXPERIENCE\n\nFIXED - Some unique ability previews are missing during the Preparation Phase.\n\nFIXED - Privacy Options can be reset to default while the player is in the middle of a match.\n\nFIXED - \"View Fullscreen\" button doesn't work for unique abilities and victory celebrations when selected using a mouse.\n\nFIXED - Duplicated pop-ups for Team Deathmatch can appear on game launch.\n\nFIXED - The Home section background is sometimes replaced by a black screen after exiting the Notifications section.\n\nFIXED - The last Operator eliminated at the end of a match doesn't appear eliminated on the scoreboard.\n\nFIXED - Team Deathmatch playlist pop-up appears before the intro cinematic finishes.\n\nFIXED - Players can join an in-progress Team Deathmatch match when there is less than 2 minutes left in the round or when 3/4 of the total eliminations has been reached.\n\nFIXED - Long delay between the end of a Custom Local Team Deathmatch match and when the MVP starts.\n\nFIXED - Player usernames aren't display during the MVP of a Team Deathmatch match.\n\nFIXED - Screen resolution slider for Display options can become unresponsive.\n\nFIXED - Crash occurs when multiple players repeatedly switch Operators while the lobby is paused by the host.\n\nFIXED - Various UI issues.\n\nFIXED - Various localization issues.\n\nFIXED - Various customization issues.\n\nFIXED - Various VFX and SFX issues.\n\nFIXED - Overall game performance.\n\n__MATCH REPLAY__\n\nFIXED - Gunshot audio replays every time a Match Replay is rewound.\n\nFIXED - Player isn't returned to the Watch section at the end of a match replay.\n\nFIXED - Match Replay experiences long loading times when transitioning between rounds if the rewind and pause buttons are pressed repeatedly as the round ends.\n\nFIXED - Match Replay recordings aren't created for Testing Grounds matches on the Test Server.\n\nFIXED - Various Match Replay camera issues.\n",
      "description": null,
      "categories": [
        "rainbow-six-siege",
        "rainbow-six",
        "patch-notes"
      ],
      "tag": "BR-rainbow-six GA-siege",
      "placement": null,
      "type": "news",
      "readTime": 8,
      "url": "https://www.ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5uvJIketTRZux4L1T4I3Ij/y7s1-demon-veil-patch-notes-addendum",
      "date": "2022-03-09T14:00:00.000Z"
    }
  ]
}