{
  "total": 755,
  "limit": 1,
  "categories": "all",
  "media": "all",
  "skip": 0,
  "startIndex": 0,
  "placement": [],
  "tags": [
    "BR-rainbow-six GA-siege"
  ],
  "items": [
    {
      "id": "4m6ZlSwqfny2omxtwCkwG0",
      "title": "Game Health Toxicity: Reputation Update",
      "abstract": "An update on Reputation Penalties and the Reputation Center.",
      "thumbnail": {
        "url": "https://staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/28xcaBvBxiZg06EUmW3jRP/280d85a653772d5c423183f6a345d1d2/GameHealth.Toxicity_header_960x540.png",
        "description": ""
      },
      "content": "## REPUTATION PENALTIES UPDATE\n\n__What Is It?__      \nThe written chat penalty aims to reduce unwanted communication and the impact that top offenders have on others in our game by triggering counter measures when repeated abuse is detected.\n\n__Expected Penalty Behavior__      \nPlayers who engage with a high amount of text chat abuse will firstly receive warnings. If the offense continues after two warnings, the written chat penalty will be triggered, leading to the player's outgoing text chat being muted to others by default for the next 30 matches.\n\n__Current State__      \nCurrently the system is in a grace period and during this period players will only receive warnings. Once over, players who did not adjust or amend their ways of communicating, will be sanctioned. We'll continue to monitor and improve this feature.\n\n## REPUTATION CENTER\n\n__What Is It?__      \nThe Reputation Center in its current release displays information about a player's active penalties and their remaining duration. As the Reputation system evolves, this section will update to display more information about a player's Reputation as well as active penalties.\n\n__Where To Find It__      \nWith two penalties being live, a Reputation tile has been added to the Home section, below the Alpha Packs tile. This tile will display the number of active penalties and provide access to the Reputation Center.",
      "description": null,
      "categories": [
        "rainbow-six-siege",
        "anti-cheat"
      ],
      "tag": "BR-rainbow-six GA-siege",
      "placement": null,
      "type": "news",
      "readTime": 2,
      "url": "https://www.ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/4m6ZlSwqfny2omxtwCkwG0/game-health-toxicity-reputation-update",
      "date": "Thu Oct 27 2022 23:00:00 GMT+0000 (Coordinated Universal Time)"
    }
  ]
}