{
  "total": 1105,
  "limit": 1,
  "categories": "all",
  "media": "all",
  "skip": 0,
  "startIndex": 0,
  "placement": "",
  "tags": "BR-rainbow-six GA-siege",
  "items": [
    {
      "id": "4CpkSOfyxgYhc5a4SbBTx",
      "title": "Dev Blog: Update on Anti-Cheat in Rainbow Six Siege",
      "abstract": "Learn about everything we've done regarding anti-cheat since June",
      "thumbnail": {
        "url": "https://staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6b0uFyrSfDjijSN3C1IAep/8ce1b0eae3e13410dff27e8d6ab797ca/DEVBLOGAntiCheat.jpg",
        "description": null
      },
      "content": "## Intro\n\nIt’s been about half a year since our [last dev blog](https://www.ubisoft.com/en-ca/game/rainbow-six/siege/news-updates/71mLMFOOVefAO9qlHMLf3O/dev-blog-rainbow-six-sieges-anticheat-war) on the Rainbow Six Siege war against cheats. For the last six months, the team has continued the fight and we would like to share with you a bit about what’s been happening behind the scenes. While we would love to be fully transparent, doing so could hinder our efforts as it could aid in the creation of new cheats. \n\nMost of our changes will be made on the backend, so you may not see them. To summarize our current status, we are actively reinforcing cheat detection by adding to existing security measures and lessening the overall ability to cheat in Rainbow Six Siege.  \n\n### Glossary \n\nThroughout the blog we’ll reference a few different groups of exploiters:\n\n- __Cheaters:__ Players using a 3rd party application, script, or macro to obtain an unfair advantage in-game or in a manner that violates the Terms of Service for Rainbow Six Siege. \n- __Cheat Developers:__ Those developing cheat applications which they then use, sell, or give to cheaters. \n- __Hackers:__ For the context of this article, these are malicious individuals/groups who are taking over accounts that are not theirs and re-selling accounts they do not own. \n\n### The Siege Team’s Approach Towards Cheating\n\n![[R6] DevBlog: Anti-Cheat Approach to Cheating](//staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/56ljHkq1ZS1qVwpkorMeOt/a35be6a0da53b5c8dccd99d4aed25b90/R6_3PillarStrategy.jpg)\n\nIn our never-ending cat and mouse game with cheaters and cheat developers, we continue to focus our efforts on 3 core points: \n\n- __Detection Improvement__ \n- __Increased Barriers__ to prevent cheaters and novel cheats \n- __Reduction of Impact__ of cheats in-game \t\n\n### 2020 in Numbers\n\n![[R6] BanCharts2021 Total ](//staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/20I0DHoeINP5Ow8Uy97ETM/d1ec88b30e58cdf23560a5331734c177/R6_BanCharts2021_Total__1_.png)\n\nBy the end of 2020, we confirmed we exceeded our previous annual ban number record by 44.73%. Improved detection, detailed reporting, and data sharing with BattlEye were big factors in this ban increase. With a continually growing population and the increased availability of cheats, new cheats and cheaters regularly keep us on our toes. \n\nIn August, we started issuing a new type of cheating sanction based on player data—something we will go into more detail on below. We used this new data detection model to ban over 4500 players between August and December. Adding this to our cheating sanctions brings us to a total of 52,69% increase in cheating bans.\n\n![[R6] Bans Graph Updated](//staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/sIAybX30CANLtRwGQNMgE/763d5e499b5d8e34462da6fc83cd28c2/R6_BanCharts2021_Data_V3.png)\n\n## A Look Back at 2020 and Where We Are Heading \n\nThe [June Dev Blog](https://www.ubisoft.com/en-ca/game/rainbow-six/siege/news-updates/71mLMFOOVefAO9qlHMLf3O/dev-blog-rainbow-six-sieges-anticheat-war) described three important topics for 2020: Detection, Blockers, and Vulnerabilities. These continue to be our focus and we have some updates to report. \n\n### 1. IMPROVED CHEAT DETECTION \n\nCheat detection will always be a work in progress, as well as a ‘’hunting’’ process. As cheating is ever-evolving thanks to changing behaviors, the continued bypassing of systems, and more, it will always be impossible to detect 100% of cheaters.\n\nThat’s why we are building new cheat detections based on statistics to uncover our most disruptive cheat users. \n\n### 1.1. USING DATA-BASED DETECTION MODELS FOR EARLY DETECTION AND FLAGGING CHEATS \n\nBans based on player statistics are still new to Rainbow Six Siege. One of the major goals of data-based cheat detection is to sanction cheaters faster. We are happy with the accuracy of our first model, but we are still operating the ban waves manually. This is causing the process to be slower than we would like. Automation for this first model is planned for the beginning of Year 6.    \n\nNew detection models will always launch manually. We start by identifying data that will make our detection model relevant. Next, we launch it on the backend and make sure we are comfortable with the results. The first ban waves are done by hand, allowing us to review each impacted player. This helps us ensure the detections are identifying concrete proof of cheating. We will continue to develop new models that give us better visibility on what is happening live in order to expedite the identification of cheaters and sanctioning them. \n\n### 1.2. IMPROVING BATTLEYE IN SIEGE\n\nFor the last six months, we have been working with BattlEye to improve cheat detections in Siege.  We will continue to ensure that our partnership with BattlEye has a positive impact on the Rainbow Six Siege community. \n\n### 2. INCREASED BARRIERS TO ENTRY AND CHEAT PREVENTION \nCheat detection is only one piece of the anti-cheat puzzle in Siege. We are also working to increase barriers to entry for both cheat developers and their users. Our goal is to cancel any benefit that could be gained from this practice by making it costly for illegitimate players.\n\n### 2.1. MAKING LIFE DIFFICULT FOR CHEATERS  \n\nIn our quest to make cheaters' lives as difficult as possible, we included APAC regions in the [2-Step Verification Ranked Lock](https://www.ubisoft.com/en-us/game/rainbow-six/siege/news-updates/5yLMh8r7wyfP4X2hL6twwv/2-step-verification-ranked-lock-update-for-pc). This not only deters cheating, but it helps secure a wider array of accounts from being hacked. Increasing the overall security of accounts is an effective way to help fight instances of account stealing or selling, and makes it harder for Cheaters, Hackers, and Cheat Developers alike.  \n\nAnother tool in the arsenal of cheaters and cheat developers is the creation of burner accounts. To combat this, we have linked BattlEye bans with Steam Vac bans, which prevent banned players from receiving game refunds. \n\nIn the upcoming months, we’ll also be keeping a closer eye on leaderboards. We are aware that cheaters are appearing in the highest rankings and will dedicate efforts to manually cleaning the leaderboards periodically. \n\n### 2.2. MAKING LIFE DIFFICULT FOR CHEAT DEVELOPERS \n\nWhile we can’t offer specifics on this topic, please know we are working to make it harder for cheat developers to analyze and modify our game. With every update we’ve launched for the past few seasons, we have continued to further secure code, making it more difficult for cheat features to keep up.\n\nCheat Developers may only be one part of the equation, but they are the source of the problem. We will continue securing our code and eliminating vulnerabilities in order to make the upkeep of cheats more costly and time-consuming.\n\n### 3. REDUCTION OF VULNERABILITIES, CHEAT OPPORTUNITIES AND IMPACT OF CHEATS \n\nWe are continuing to learn a great deal from our battle against cheating as we fight on multiple fronts, from live issues and fires, to planning the future of Siege’s anti-cheat responses, through to making sure we maintain visibility on our vulnerabilities. \n\n### 3.1. VULNERABILITY ASSESSMENT\n\nCheat developers take advantage of vulnerabilities to create their cheats. For this reason, we assess our vulnerabilities every season to not only detect current vulnerabilities, but also to predict what new loopholes could be found in the future. We keep the Ubisoft game security team close and use their knowledge to plan our initiatives and understand past and present errors. \n\n### 3.2. VULNERABILITY FIXES \n\nIn addition to using software to discover potential risks, we actively keep an eye on social media and work closely with the community team and customer support to concentrate our efforts on issues that matter to our players.  As soon as we discover vulnerabilities, we get to work on fixing them. In some instances, there are no simple solutions, so we complement prevention with detection. \n\n## What is Next? \n\nWe have big plans on the horizon for our team and for the game, and have no intention of slowing down. While we can’t go into full detail at this time, we hope this Dev Blog has helped you understand some of the work we do behind the scenes. This work is rarely user-facing and can be overthrown by new cheat iterations, but we’ll keep pushing to improve on all fronts. \n\nIn the future, the anti-cheat team plans to remain transparent by publishing Dev Blogs when we have notable updates to share.\n\n## Conclusion\n\nFor every wall reinforcement that we deploy, Cheat Developers are trying to breach in another room. But it far from deters our will to rid the game of as many opportunists and cheaters as we can. We are dedicated to making Siege secure and fair for everyone. We look forward to sharing exciting new releases in future Dev Blogs. Until then, keep reporting cheaters in-game and stay safe out there. \n",
      "description": null,
      "categories": [
        "rainbow-six-siege",
        "rainbow-six",
        "community"
      ],
      "tag": "BR-rainbow-six GA-siege",
      "placement": [
        "featured-news-article"
      ],
      "type": "news",
      "readTime": "8",
      "url": "https://www.ubisoft.com/en-us/game/rainbow-six/siege/news-updates/4CpkSOfyxgYhc5a4SbBTx/dev-blog-update-on-anticheat-in-rainbow-six-siege",
      "date": "2021-02-03T05:00:00.000Z"
    }
  ]
}