{
  "total": 1125,
  "limit": 1,
  "categories": "all",
  "media": "all",
  "skip": 0,
  "startIndex": 0,
  "placement": "",
  "tags": "BR-rainbow-six GA-siege",
  "items": [
    {
      "id": "H43mydDKCmk",
      "title": "Rainbow Six Siege: R6 Share Tier 2 Teams | Ubisoft",
      "abstract": null,
      "thumbnail": {
        "url": "https://i.ytimg.com/vi/H43mydDKCmk/maxresdefault.jpg",
        "description": "Rainbow Six Siege: R6 Share Tier 2 Teams | Ubisoft"
      },
      "content": "[video](https://www.youtube-nocookie.com/embed/H43mydDKCmk)",
      "description": "The R6 SHARE Tier 2 teams are available now. Customize your load out to support your favorite team!\n\nR6 SHARE ensures that for every team-branded item sold, the R6 SHARE organization will receive 30% of the proceeds from their respective team-branded items. Plus, 30% of the organization’s revenue share will contribute to the organization’s players and content creators.\n\n#R6S\n\nPlease SUBSCRIBE: http://bit.ly/UbisoftYouTubeChannel\n \nVisit our official channels to stay up to date with Rainbow Six Siege:\nhttps://rainbow6.ubisoft.com/\nhttps://www.facebook.com/rainbow6usa/\nhttps://www.instagram.com/rainbow6gam...\nhttps://twitter.com/Rainbow6Game\nhttps://www.youtube.com/UbisoftNA\n \nDiscover all our Rainbow Six products and exclusive items on the Ubisoft Store: https://ubi.li/DZNaP\n \nABOUT RAINBOW SIX SIEGE:\nRainbow Six Siege is an exciting, new approach to the first-person shooter experience that puts tactical combat and masterful destruction at the center of the action. Lead your team of unique, counter-terrorist Rainbow operators through tense and thrilling combat scenarios, and achieve victory through smart preparation and strategic improvisation. Rainbow Six Siege is available now on Xbox One, PlayStation® 4 and PC.\n  \n KEY FEATURES:\n  \n -THE RULES OF SIEGE: Five versus Five. Attack versus Defend. Infiltrate versus Fortify. Team-based strategy meets intense, tactical combat.\n -WORLD'S ELITE COUNTER-TERRORIST OPERATORS: Choose your Operator and wield their unique ability to breach or defend the objective as a part of an elite team.\n -DESTRUCTION AS A TOOL: Walls can be shattered; floors and ceilings can be breached. Mastering the tactical use of destruction is the key to victory.\n -CLOSE-QUARTERS COMBAT: With tight spaces shaping all combat arenas, tense encounters and up-close-and-personal firefights abound within every Siege.\n\nABOUT UBISOFT:\nUbisoft is a leading creator, publisher and distributor of interactive entertainment and services, with a rich portfolio of world-renowned brands, including Assassin’s Creed, Far Cry, For Honor, Just Dance, Watch Dogs, Tom Clancy’s video game series including Ghost Recon, Rainbow Six and The Division. The teams throughout Ubisoft’s worldwide network of studios and business offices are committed to delivering original and memorable gaming experiences across all popular platforms, including consoles, mobile phones, tablets and PCs. For the 2019-20 fiscal year, Ubisoft generated net bookings of €1,534 million. To learn more, please visit: www.ubisoftgroup.com.  \n\n© 2021 Ubisoft Entertainment. All Rights Reserved. Ubisoft and the Ubisoft logo are registered trademarks in the US and/or other countries.\n\nRainbow Six Siege: R6 Share Tier 2 Teams | Ubisoft [NA]\nhttp://www.youtube.com/UbisoftNA",
      "categories": [
        "videos"
      ],
      "tag": null,
      "placement": null,
      "type": "videos",
      "readTime": null,
      "url": "https://www.youtube.com/watch?v=H43mydDKCmk",
      "date": "2021-06-22T18:04:01.000Z"
    }
  ]
}