{
  "total": 774,
  "tags": [
    "BR-rainbow-six GA-siege"
  ],
  "items": [
    {
      "id": "26Ar2mQAv7zwB6MN61HVPt",
      "title": "Demon Veil Reddit AMA Wrap-Up",
      "abstract": "Miss our recent Reddit AMA on Maps & Ops? We’ve collected our answers here for easy reading – and keep an eye out on our channels for future AMAs!",
      "thumbnail": {
        "url": "https://staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/HumVNrTEeDEbkA3ibpHiU/c214adb4a29d6aeab90f73dd74467fad/DevTeamAMARecap_ArticleHeader.png",
        "description": ""
      },
      "content": "Coming hot off the recent release of Emerald Plains, our dev team were excited to answer your burning questions about Maps and Operators - past, present, and future. Over the course of the AMA, they answered a variety of topics, including night maps, the design process of Emerald Plains, and their approach to keeping Siege fresh each season. [You can review the full AMA here!](https://www.reddit.com/r/Rainbow6/comments/uep42q/ama_we_are_the_rainbow_six_siege_dev_team_ask_us/)\n\nWe're planning more focused AMAs like this in the future to cover a range of different topics, so keep an eye out for future Q&As!\n\n---\n\n__MAPS__\n\n__Q:__ *What are your plans to combat players banning future new maps/reworks instead of giving them an honest chance?*\n\n__A:__ Good question! We have plans to change up the existing map ban system later this year and will be sharing more soon but suffice to say, this new system should lead to a wider range of maps seeing more active play in Ranked!  - Alexander\n\n([Full Post Here](https://www.reddit.com/r/Rainbow6/comments/uep42q/comment/i6owdok/?utm_source=reddit&utm_medium=web2x&context=3))\n\n<br>\n\n__Q:__ *Curious about Emerald Plains design and what other maps it incorporates from. With the map design process, do you look at other maps and try to incorporate similar structure? Or is it from the ground up?* \n\n__A:__ The comparisons to Bartlett make sense - Emerald Plains DID begin its life as a Bartlett rework. As we proceeded to change more and more of the map during the reworking phase, we quickly found that it was becoming its own map and didn't fit our definition of a rework, so we decided to shift gears and lean into the newness, theme and all. While there are hints and nods to its old self like the foyer and two front towers, its moment-to-moment gameplay flow is entirely different from its humble beginnings as a Bartlett rework.  - Frédéric and Yann\n\n([Full Post Here](https://www.reddit.com/r/Rainbow6/comments/uep42q/comment/i6ot1ea/?utm_source=reddit&utm_medium=web2x&context=3))\n\n<br>\n\n__Q:__ *Is there a possibility to see night maps return to the game, possibly in Casual mode?*\n\n__A:__ Whenever we choose to make a night map, we need to ensure that it's well-lit to ensure the most balanced and competitive environment possible. It doesn't matter whether a future map is night or day, but the lighting of the map needs to offer fair play. We don't have plans to turn past maps into night maps, but we aren't closing the door to future maps!  - Alexander\n\n([Full Post Here](https://www.reddit.com/r/Rainbow6/comments/uep42q/comment/i6ou0w1/?utm_source=reddit&utm_medium=web2x&context=3))\n\n<br>\n\n__Q:__ *What kind of challenges does bringing in new maps for TDM present to the Level Design team? With the introduction of TDM, is this the start of a more reinforced casual side to Siege?*\n\n__A:__ The main challenge is that this is largely new to us in the scope of Siege. We're used to thinking about attack and defense aspects of our maps, but for TDM, we need to make sure no one area is too defensible - you should be able to easily navigate, and orient yourself, and easily identify opponents at a glance. Let's just say that after making this, we have a lot of ideas we didn't get a chance to use, so we have those stored away.\n\nAs for the question about Siege's casual side, when we have a community that's as large and diverse as the Siege community, we absolutely want to reinforce our casual playlists just as much as we reinforce the competitive side, so this is something that's always important to us to consider.  - Yann and Alexander\n\n([Full Post Here](https://www.reddit.com/r/Rainbow6/comments/uep42q/comment/i6ovxg5/?utm_source=reddit&utm_medium=web2x&context=3))\n\n<br>\n\n__Q:__ *How arduous is the process of finding and fixing exploits, unfair angles, and other cheesy things when creating a new map?*\n\n__A:__ We wish we played viciously enough to catch everything on the first pass! Our QC team is incredibly instrumental in helping us find these issues given the amount of time they put into these maps ahead of release.\\\nAt the end of the day, though, the community also plays a huge role in this process, as millions of players tend to help catch things that a singular Map team may not always catch. We appreciate your ability to stretch the game's boundaries to their max, which helps to catch these exploits. It makes for an interesting process of searching, resolving, getting feedback, and continuing to iterate.  - Frédéric and Yann\n\n([Full Post Here](https://www.reddit.com/r/Rainbow6/comments/uep42q/comment/i6p04nx/?utm_source=reddit&utm_medium=web2x&context=3))\n\n<br>\n\n__Q:__ *How do you tackle map reworks on maps that are popular?*\n\n__A:__ Oregon is a great example of this. Before every rework, we look at pick rate and win rate of objectives and seek to try and equalize them. This one in particular was becoming stale prior to the rework and certain objectives were played the same way every time, so we tried to analyze which aspects of the map were strongest and most fun. This is where a workshop with pros came in. We often work with them to identify how to make the game flow more versatile and offer up more ways that plays can approach a map instead of falling into a routine they use every time.  - Yann\n\n([Full Post Here](https://www.reddit.com/r/Rainbow6/comments/uep42q/comment/i6oumb3/?utm_source=reddit&utm_medium=web2x&context=3))\n\n<br>\n\n__Q:__ *Emerald Plains only has a single point of entry on the roof of the map. What was the thought process behind this?*\n\n__A:__ Putting entry points on the roof tends to be a tricky balancing act, as there are often very few ways for Defenders to counteract this - specifically when there are hatches on the roof. Regarding the skylight, it was originally far more powerful in an earlier version, but we found with testing that even if you were more vulnerable while rappelling all the way down, it was way too much of an advantage for Attackers and had to be tweaked.  - Yann\n\n([Full Post Here](https://www.reddit.com/r/Rainbow6/comments/uep42q/comment/i6p9sa0/?utm_source=reddit&utm_medium=web2x&context=3))\n\n<br>\n\n__OPERATORS__\n\n__Q:__ *Will we ever have a unique combination of armor and speed in the future? (ie. 3 armor 2 speed)*\n\n__A:__ Good question! This is something we've experimented with, but are still looking at how we can \"break\" this system with it still being fun and balanced. We've also been toying with a 4-speed Operator, but the world's not ready yet (and maybe we'll never be ready for it). - Dominic\n\n([Full Post Here](https://www.reddit.com/r/Rainbow6/comments/uep42q/comment/i6p1i8p/?utm_source=reddit&utm_medium=web2x&context=3))\n\n<br>\n\n__Q:__ *One of the complaints from more old-school or traditional players is that the game has lost its more realistic tone and design, especially so in the gadgets. Do you plan on continuing this trend of futuristic and sleek looking gadgets? Or do you plan on mixing in more grounded looking gadgets as well as more futuristic looking ones?*\n\n__A:__ Since Siege's inception, it's been important to us to ground the concepts behind our gadgets in existing real-life technology with the caveat that fun and balanced gameplay comes first. Sometimes, it's necessary to stretch the bounds of reality and the real life tech we use as inspiration to fit the gameplay. Just look at Thatcher and Pulse: a grenade-sized EMP capable of disabling most electronic gadgets and a handheld heartbeat sensor of this strength take tech people are familiar with and stretch their reality to make them fun in a game concept.\n\nWith your example of Thorn, this is quite close to how we handled Thatcher. The look of gadgets may touch on an Op's lore, but 1:1 translations from real life often don't have the same fun factor, so this is where the ingenuity of our designers comes in.\n\nLooking to the future, we will strive to strike a balance between real life tech inspiration and near-future innovation, all while prioritizing fun-factor. We still apply the same care and thoughtfulness to our gadgetry that we did with our Operators 7 years ago. - Alexander\n\n([Full Post Here](https://www.reddit.com/r/Rainbow6/comments/uep42q/comment/i6p2xm9/?utm_source=reddit&utm_medium=web2x&context=3))\n\n<br>\n\n__Q:__ *How did you collaborate with the game balance team when introducing Azami and her gadget to make sure it isn't too OP, especially since her ability can modify the entire flow of a room?*\n\n__A:__ From the prototyping phase, we sit down with Balancing once a week to explain our intentions and get an idea of any concerns they may have. This way, we can look at how best to strike that balance and offer as many possible ways to tweak an Operator in the future. We also take time to consider how they can affect (and be affected) by older legacy maps, which sometimes leads into considering reworks for the future. In that way, making an Operator isn't JUST about talking with Operator designers - it touches so many other teams. - Dominic and Frédéric\n\n([Full Post Here](https://www.reddit.com/r/Rainbow6/comments/uep42q/comment/i6p25q0/?utm_source=reddit&utm_medium=web2x&context=3))\n\n<br>\n\n__Q:__ *How do you decide who gets what scope magnification? Is there a reason some guns have a 1x and a 2x, but not a 1.5x?*\n\n__A:__ This really comes down to balancing the distance that an Op is viable at. Due to the nature of their gadgets and gameplay, this helps to determine where Ops play, so choosing their scope magnifications is an extension of helping to define where and what range they play from. This is also why different Ops might have different scopes available, tying directly into their unique styles of play.    \nAlso, we ARE investigating adding 1.5x scopes, so that's something we're looking at for the future.  - Dominic\n\n([Full Post Here](https://www.reddit.com/r/Rainbow6/comments/uep42q/comment/i6okjp4/?utm_source=reddit&utm_medium=web2x&context=3))\n\n<br>\n\n__Q:__ *Why the shift towards not releasing new weapons and instead reusing weapons?* \n\n__A:__ We have a massive roster of weapons and while there's always a chance of introducing new ones in the future, we also want to ensure we use the over 100 guns already in the game to build interesting loadouts that expand on weapons that are fan-favorites or that haven't had the chance to shine. We'd still love to give renewed life to weapons that have been in there from day 1.  - Dominic\n\n([Full Post Here](https://www.reddit.com/r/Rainbow6/comments/uep42q/comment/i6p7y52/?utm_source=reddit&utm_medium=web2x&context=3))\n",
      "description": null,
      "categories": [
        "rainbow-six-siege"
      ],
      "tag": "BR-rainbow-six GA-siege",
      "readTime": 9,
      "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/26Ar2mQAv7zwB6MN61HVPt/demon-veil-reddit-ama-wrapup",
      "date": "Mon May 09 2022 14:00:00 GMT+0000 (Coordinated Universal Time)"
    }
  ]
}