{
  "total": 1108,
  "limit": 1,
  "categories": "all",
  "media": "all",
  "skip": 0,
  "startIndex": 0,
  "placement": "",
  "tags": "BR-rainbow-six GA-siege",
  "items": [
    {
      "id": "dgqT0JSmCGnA7wjReE3LC",
      "title": "Y6S1 PRE-SEASON DESIGNER'S NOTES",
      "abstract": "In this latest edition of Designer’s Notes, we'll go into more detail about the balancing changes that’ll come with the Crimson Heist patch and give you an insight into the reasons behind these changes.",
      "thumbnail": {
        "url": "https://staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5njbiYMWcZreMHWLm9jWY9/200fc861d792fa0a4274bc83215b9305/R6_DesignersNotes_Y6S1_1920X1080_Title.png",
        "description": null
      },
      "content": "In this latest edition of Designer’s Notes, we'll go into more detail about the balancing changes that’ll come with the Crimson Heist patch and give you an insight into the reasons behind these changes.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n__WIN DELTA VS. PRESENCE__\n\n![Y5S4.3 Matrix Attackers (1)](//staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6maHoyjNF23VeYlPqVAzoR/51d529647cfc2d1e77c745269b8bf9e9/Y5S4.3_Matrix_Attackers__1_.jpg)\n\n![Y5S4.3 Matrix Defenders](//staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4CMDiusILMnCU1E2URvbmR/8588f897afc258fa6b20114e7940cb09/Y5S4.3_Matrix_Defenders.jpg)\n\n*Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.*\n\n*Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.*\n\n__OPERATOR BAN RATE__\n\n![BanMatrixAttY5S4.3](//staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1u1oIZyuQsmvUxv8HqNRM4/951ac835344c7441b35bdab3e23ca504/BanMatrixAttY5S4.3.png)\n\n![BanMatrixdefY5S4.3](//staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/gbj5zgZQATEOdBn6k3r7S/086035bd9f7e282126870e13a9aa1475/BanMatrixdefY5S4.3.png)\n\n# OPERATOR BALANCING\n\n### KALI\n\n- Increased CSRX 300 damage to 127 (from 122)\n  - 1 body shot will kill a 3-speed Operator\n  - 1 body shot will DBNO a 2-speed Operator\n  - 1 body shot will DBNO a 1-speed Operator\n  - Wearing Rook Vest\n    - 1 body shot will DBNO a 3-speed Operator\n    - 2 body shots will DBNO a 2-speed Operator\n    - 2 body shots will DBNO a 1-speed Operator\n\nPopulation targeted by this change: Casual, Top Ranked and Pros.\n\nOur main objective with Kali is to make her a viable and balanced operator. In general, this requires us to strike the right balance between ability (LV Explosive Lance) and loadout. For Kali in particular, this depends on two main elements. The first is that Kali brings a great amount of utility to the game. The LV Explosive Lance can deal with gadgets, including bulletproof gadgets and ones behind electrified reinforcements. The second element is the CSRX 300. This primary weapon is in charge of most of her killing potential, and keeping this weapon in line is key to avoiding an overpowered operator.\n\nUnsurprisingly, finding the right balance for a one-shot-kill weapon can take a number of iterations. We noticed that on release, Kali was perceived as overpowered, but the power perception has been slowly drifting towards \"underperforming.\" In the previous patch, we took our first step in finding the sweet spot for the CSRX 300. We have looked at your feedback and we are making new changes.\n\n__What we've done so far:__\n\nWe started by identifying the 1-shot-DBNO mechanic as one of the main issues. The mechanic was perceived as frustrating and it did not allow us to tweak the weapon power level, so we decided to transform the CSRX 300 into a normal weapon. Now, we can modify the weapon damage and iterate until we find the sweet spot.\n\nWith this change, we've also tackled the lack of counter for Kali's CSRX 300. For example, now, wearing Rook's Armor Plates can now help Operators to survive a body shot.\n\nWe also wanted to keep the damage modifiers caused by bullets getting through walls or hitting Operators limbs', as this helps to prevent lucky shots that can kill or put Operators in to DBNO. This also ensures good aim is rewarded.\nThe first iteration set the damage at 122. With this value, we had a compromise where 3-speed Operators would die from a chest shot and 1-speeds would survive it. This compromise took into account that 1-speed Operators do not represent a majority in a defensive line-up, especially on Pro League. This approach has been perceived as too weak, though, and we are making new changes to address that.\n\n__What we're doing now:__\n\nOur next step is to increase the weapon damage to make 1-speed Operators also fall into DBNO. Like last time, we will be monitoring your feedback and the game data to ensure we continue tracking towards finding that sweet spot for Kali. For some Operators, balance is a process that takes iteration, so we appreciate the feedback and insight the community has shared here!\n\n__Additional insight into Kali's interaction with Rook's Armor Plate:__\n\nWith the above change in mind, we want Rook's ability to be relevant against Kali's CSRX 300. We are not creating any specific rules for the interaction, but we want to clarify how Rook's Armor works:\n\nWhen an operator is wearing Rook's Armor Plate, their armor gains an extra 15% protection. This means that:\n\n- A 3-speed Operator will have 15% damage reduction.\n- A 2-speed Operator will have 25% damage reduction.\n- A 1-speed Operator will have 35% damage reduction.\n\nThis means that with the new damage value, only 3-speed operators will fall into DBNO when receiving a CSRX 300 body shot. The rest of the 2 and 3-speed Operators will survive that shot.\n\n### BLACKBEARD\n\n- Reduced Shield HP to 20 (from 50)\n- Reduced MK17 damage to 40 (from 49)\n\nPopulation targeted by this change: Casual, Top Ranked and Pros.\n\nAccording to the Balancing Matrix, Blackbeard continues to be a force to reckon with, sporting the highest Attacker win delta. Between the great utility afforded by his Rifle Shields and a loadout with strong damage capabilities that has earned him a high K/D, he is a point of frustration for Defenders.\n\nBy reducing the HP of his shields and damage of his MK17, this will slightly reduce both his killing potential and survivability. Given that the majority of the time, Blackbeard ends matches with shield economy to spare, this change should be fair to both sides as it brings him more in line with other Attackers.\n\n### DOKKAEBI\n\n- Added Gonne-6 (Removed C75)\n- Added Stun Grenades (Removed Frag Grenades)\n\nPopulation targeted by this change: Casual, Top Ranked and Pros.\n\nDokkaebi is the first of two Operators who will be encountering a loadout shakeup this patch to make way for the newest gun in the Siege armoury. The Gonne-6 will replace the C75 as her secondary weapon, providing highly accurate explosive utility for dealing with gadgets, abilities and Operators. As a result, her gadgets have also been tweaked to limit the number of explosives at her disposal.\n\nIt's no secret that Dokkaebi has received a number of loadout changes in the past year. The initial intention for giving her Frag Grenades was to offer more utility against bulletproof devices rather than to increase killing potential. By switching to Stun Grenades, she will retain this utility against bulletproof devices while also empowering her with a wider range of tools to better adapt to her surroundings while disrupting Defenders.\n\n### FINKA\n\n- Added Gonne-6 (Removed GSH-18)\n- Added Stun Grenades (Removed Frag Grenades)\n\nPopulation targeted by this change: Casual, Top Ranked and Pros.\n\nLike Dokkaebi, Finka is also receiving an update to her loadout, gaining the Gonne-6 secondary weapon and replacing her Frag Grenades with Stun Grenades. Given her strong win delta compared to other Attackers on the Balancing Matrix, the slight reduction in AoE damage capabilities is not expected to have a significant effect on her performance, particularly now that she is able to accurately deny many Defenders’ tools with the Gonne-6.\n\n### MOZZIE\n\n- Warning will hint at the distance to Pests by modifying its blinking speed\n\nPopulation targeted by this change: Top Ranked and Pros.\n\nIn its current state, Mozzie’s Pest lacks clear counters and often forces Attackers to waste time and resources in order to avoid or mitigate obvious traps. The difficulty countering him has made Mozzie a particularly useful Operator, and has contributed to driving up his presence in the Balancing Matrix.\n\nBy adding a proximity warning to Pests, this provides Attackers with a tool to more effectively avoid or deal with clear traps. While this change will not fundamentally change Mozzie’s moment-to-moment actions, it will encourage more creative placement of Pests to get the jump on Attackers.  \n\n### NØKK\n\n- While HEL Presence Reduction is active, Nøkk won't activate proximity-based gadgets\n  - Gadgets affected: Ela's Grzmot Mine, Melusi’s Banshee, Kapkan’s Entry Denial Device, Proximity Alarm, and Metal Detectors\n- Nøkk's glitch effect will cancel the proximity immunity, resulting in the activation of any gadget in range\n- The color of the HEL device on Nøkk’s hand will change colour when bypassing any proximity device\n\nPopulation targeted by this change: Top Ranked and Pros.\n\nNøkk was initially designed as a counter-intel Operator, but not every intel tool is a camera. Devices triggered by proximity give very useful information as the activation’s sound cue provides information without requiring players to lower their weapon. We want to make Nøkk's gadget more interesting to play and useful against more defensive setups.\n\n__Please note, this is a TEST SERVER ONLY change.__ We will turn it off before releasing the new season to continue working on her. We have tested this change internally and while we feel it adds an interesting dynamic to her play, there are still some unanswered questions. Therefore, we would like to hear your feedback and iterate before deploying this to the wider community.\n\n### TWITCH\n\n- Added Smoke Grenades (Removed Stun Grenades)\n\nPopulation targeted by this change: Top Ranked.\n\nTwitch continues to have a high presence in the Balancing Matrix. This is due in part to her high killing potential and aggressive playstyle as a secondary entry fragger.\n\nBy replacing her Stun Grenades with Smoke Grenades, this removes one of the tools that empowers such aggressive play and opens up additional role opportunities for players who would rather hang back and provide support. We will continue to monitor how this affects her playstyle to ensure any changes retain the core of why players love Twitch.\n\n# WEAPON BALANCING\n\n### G36\n\n- Improved recoil\n\nPopulation targeted by this change: Casual, Top Ranked and Pros.\n\nIt's no secret that the G36 has been overshadowed by the R4C and ARX and is in need of a tweak. In order to make it feel better to use while bringing it more in line with the effectiveness of its contemporaries, this assault rifle's recoil has been updated.\n\nPlayers should notice an immediate change in its handling. Specifically, recoil will no longer drift horizontally, making it more reliable. Like anything relating to the handling of weapons, though, it's important to note that we are continuing to look at how we can further improve the feel of different weapons in players' loadouts.\n\n# OTHER CHANGES\n\n### DISABLED STATE FOR ELECTRONIC GADGETS\n\nWith Year 6 Season 1, when a gadget is disabled by Mute, there will be proper feedback showcased to players. \n\nExpect feedback when the following gadgets are disabled while in play:\n\n- Attacker drones\n- Breach Charges\n- Hibana's X-Kairos\n- Fuze's Cluster Charge\n- Thermite's Exothermic Charge\n- Zero's ARGUS Cameras\n- Claymores\n- Nomad's Airjabs\n\n---\n\nTry out the latest Rainbow Six updates on the Test Server and earn an exclusive charm through the [Bug Hunter Program](http://rainbow6.com/bughunterprogram).\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game), [Reddit](https://www.reddit.com/r/Rainbow6/), [Facebook](https://www.facebook.com/Rainbow6/) and on our [forums](https://forums.ubi.com/forumdisplay.php/64-Rainbow-Six).\n",
      "description": null,
      "categories": [
        "rainbow-six",
        "rainbow-six-siege"
      ],
      "tag": "BR-rainbow-six GA-siege",
      "placement": null,
      "type": "news",
      "readTime": "10",
      "url": "https://www.ubisoft.com/en-us/game/rainbow-six/siege/news-updates/dgqT0JSmCGnA7wjReE3LC/y6s1-preseason-designers-notes",
      "date": "2021-02-22T17:00:00.000Z"
    }
  ]
}