{
  "total": 1064,
  "limit": 1,
  "categories": "all",
  "media": "all",
  "skip": 0,
  "startIndex": 0,
  "placement": "",
  "tags": "BR-rainbow-six GA-siege",
  "items": [
    {
      "id": "1YPQ5yw9TaRhQwghjStqn2",
      "title": "Top Issues and Community Concerns",
      "abstract": "We will be updating the following list regularly to outline the status of certain issues that are currently pressing for our community.",
      "thumbnail": {
        "url": "https://staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3Igh9risyDOnxa8nmFKVPW/5fd6b25a6ed43d5b361c736e75fc280f/topissues_349922.png",
        "description": null
      },
      "content": "__Updated:  June 26th 2020__\n\nWe will be updating the following list regularly to outline the status of certain issues that are currently pressing for our community. Please note that this list is not exhaustive, and should only be used as a reference to give a general idea of where our focus currently is.\n\n# Top Issues\n\n## New sound packaging system\n\n__Description:__ Our priority on that front is to first repackage the way sounds are stored and connected to the game.\n\nWe currently have a limited ability to fix specific issues and this improvement should make it easier for us to work on the audio aspect of the game.\n\nFor more information on this topic, please refer to the [Status Report blog](https://rainbow6.com/statusreport).\n\n__Status: Target: Y5S3__\n\n## DDoS on consoles\n\n__Description:__ We are working on mitigation plans with our partners and we are continuously monitoring the situation. We’ll continue to share updates on the situation until the matter is solved.\n\n__Status: Ongoing__\n\n## Cheating & Hacking\n\n__Description:__ We continue working in close collaboration with all our partners to flag, report & identify cheaters as effectively as possible.\n\nSteel Wave contained dissuasive measures such as rank lock below level 50, as well as a limit of 100 games to reach the Champion’s rank.\n\nWe are also working on other options to continue improving the situation on that front, we'll share a detailed overview on the topic very soon.\n\n__Status: Ongoing__\n\n## Profile Panel & Reporting\n\n__Description:__ Additional context and explanations will be added to the in-game reporting panel. In an effort to effectively address the situation, having more accurate player reports will facilitate information gathering on our end.\n\n__Status: Target: Y5S2.2__\n\n\n# Top Gameplay Topics\n\n## Balancing\n\n__Description:__ During the Steel Wave test server period we received a number of feedback requests for balancing tweaks to the new Operators. After evaluating feedback from players, and data from the TS, we plan to make a few balancing changes to the new operators with the 2.1 patch.\n\n__Melusi__\n\n- Lowering the penalty zone by approximately 33%.\n- Lowering the sound of Banshee effect in first person PoV.\n\n__Ace & Hibana__\n\n- Remove the possibility of destroying Bandit's Batteries through reinforcements, by placing the charges on the floor\n\n__Status: Target: Y5S2.1__\n\n## Consistency on gadgets destroying props\n\n__Description:__ There are inconsistencies in how gadgets interact/destroy props on maps.\n\nSimilar to how we implemented consistency on how props break on projectile trajectory in Y4S4, we are working on a system for deployable gadgets’ interaction with these props.\n\n__Status: Target: Y5S3__\n\n## Sensitivity per zoom level\n\n__Description:__ We are adding the possibility to set a specific sensitivity for each zoom levels / sights.\n\n__Status: Target: Y5S3__\n\n## Improved Flash detection/consistency\n\n__Description:__ The rework intends to make flash detection more reliable. Enemies are often not affected by flashes due to objects and obstacles. We want to simulate the light ricochet with the environment, to guarantee the effectiveness of flashbangs & other similar gadgets.\n\n__Status: Target: Y5S4__\n\n## Vault Detection Code\n\n__Description:__ We are currently looking at improving the vault detection code to make the action easier to perform and to be more reliable\n\n__Status: Target: Y5S3__\n\n\n# Top Community Topics\n\n## Match Cancellation\n\n__Description:__ To address frustrations where players are placed into a game with incomplete teams on either side, we are working on a Match Cancellation feature, that you may have tried on the Test Server.\n\nThe goal will be to allow players to cancel matches in the early stages of a game under the condition that their team is incomplete.\n\n__Status: Target: Y5S2.1__\n\n## Improved notification and feedback for deactivated operators\n\n__Description:__ Improved in-game notifications and feedback for when an Operator has been deactivated.\n\nThere have been times when we have had to deactivate an Operator in-game to better the play experience when exploits arise. We are working on better feedback to our players when such an occasion arises.\n\n__Status: Target: Y5S3 __\n\n## Defuser planting detection improvements\n\n__Description:__ Interactions with the defuser could often lead to some issues, in Y5S4 we’ll address the following ones:\n\n- Defuser plant prompt is sometimes missing when the player is on site\n- Defusers can be planted outside of the site when the players sits on the edge of the area.\n- Players could drop the defuser when attempting to plant.\n\n__Status: Target: Y5S4__\n\n## Notification System\n\n__Description:__ The in-game notification system often displayed outdated or already read alerts. It should guarantee that these notifications are relevant to the players.\n\n__Status: Target: Y5S3__\n\n## Known Bugs / Issues \n\n- Spinning on specific locations could lead to FPS drops for anyone in the same game.\n- The Banshee's hitbox is inaccurate and covers more than the model.\n- The defuser can be planted on the edge of the hatch in 2F Master Bedroom on House\n\n---\n\n__Updated:  May 27 2020__\n\n# HACKING, CHEATING, LOBBY FREEZING UPDATE\n\nTo follow up on our last Top Issues update below in April, we would like to give you all a status update on the hacking, cheating, and lobby-freezing issues. We'll go over some of the steps we have taken where we have found success, where we are still working to make improvements, as well as emphasize our continued focus on cheating and hacking as priority issues.\n\n### LOBBY FREEZING\n\n__Lobby-Freezing:__ Lobby-freezing occurs while in menu or while loading into a round, and no connectivity icons will appear.\n\n__Update:__ After our April Top Issues blog, we made an update to the game that would allow us to gather more data to accurately track and identify lobby-freezers. We were able to successfully use that data to implement an auto-kick feature for individuals identified as holding up games through extreme loading times. Kicked players will receive an abandon sanction and be locked out of ranked/unranked until the match is over. We have been monitoring the automatic kicks for some time now on the live servers and have observed high success rates of detecting and only kicking players who are holding up lobbies to the detriment of the other players in the game. We are continuing to gather data on console lobby-freezing before we finalize plans to activate the lobby-freeze autokick detection on console as well.  \n\n### DOS ON CONSOLE\n\n__DOS:__ DOS attacks can be distinguished from lobby-freezing as they typically occur during gameplay and the connectivity icons will appear.\n\n__Update:__ We have also observed some unusual network traffic and activity for Console players and suspect that some cases of lobby-freezing on Console may be tied to DOS attacks.  We are currently pursuing this and investigating the issue and will update when we learn more.\n\n### HACKING/CHEATING\n\n__Update:__ In our last update, we re-emphasized that we do not tolerate cheating in-game and were preparing a number of short and long term strategies to address the cheating frustrations. While we are aware this is still an ongoing issue, we believe these upcoming changes will help to mitigate some of the frustrations as we work internally on more robust long-term solutions.\n\n- __Offline Bans (Target date: End of May):__ We will begin banning players offline. Previously, sanctioned accounts were banned after logging back into Siege. Accounts will now be banned even if they remain offline. This will provide more clarity on the ban feedback loop and improve visibility on banned accounts.\n- __Increased Clearance Level Requirements for Ranked (Target date: Y5S2):__ In Y5S2 we will be increasing the required clearance level for players to play Ranked. This is aimed at increasing the barrier to access for illegitimate accounts for Ranked to promote a better Ranked environment.\n- __Increased Champion Rank Requirements (Target date: Y5S2):__ In Y5S2 we will be increasing the requirements for players to be eligible for Champion Rank. In addition to meeting the minimum 5000 MMR, eligible layers will be required to have played at least 100 ranked matches to qualify. This is also aimed at increasing the barrier to access for illegitimate accounts and maintaining a clean Champion leaderboard\n- __XP level cap in PvE: (Status: Active)__ We have already put an XP cap in PvE in place in order to increase barriers to entry for Ranked for smurfs.",
      "description": null,
      "categories": [
        "news",
        "rainbow-six",
        "rainbow-six-siege",
        "patch-notes"
      ],
      "tag": "BR-rainbow-six GA-siege",
      "placement": [
        "featured-news-article",
        "featured-news-article-emea",
        "featured-news-article-ncsa"
      ],
      "type": "news",
      "readTime": "8",
      "url": "https://www.ubisoft.com/en-us/game/rainbow-six/siege/news-updates/1YPQ5yw9TaRhQwghjStqn2/top-issues-and-community-concerns",
      "date": "2020-06-26T16:00:00.000Z"
    }
  ]
}